<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <meta name="author" content="Romain Tavenard" />
  <title>MongoDB   Session 2</title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="../../../css/md.css" type="text/css" />
</head>
<body>
<div id="header">
<h1 class="title">MongoDB <br /> Session 2</h1>
<h2 class="author">Romain Tavenard</h2>
</div>
<p>Pour cet examen de contr&#244;le continu, tous les documents sont autoris&#233;s et l&#8217;acc&#232;s &#224; internet n&#8217;est pas interdit &#224; l&#8217;exception stricte des moyens de discussion de type e-mails, messagerie instantan&#233;e, etc. Toute contrevenance &#224; cette r&#232;gle simple entra&#238;nera la note de 0 sans prise en compte d&#8217;aucune excuse que ce soit.</p>
<h1 id="la-collection-bikes"><span class="header-section-number">1</span> La collection <code>bikes</code></h1>
<ol style="list-style-type: decimal">
<li><p>Importez la collection <code>bikes</code> (contenue dans le fichier <code>bikes.json</code> disponible sur CURSUS) dans la base de donn&#233;es <code>keolis</code>.</p></li>
<li><p>Affichez les stations les plus proches de la position de latitude 48.1&#176;N et de longitude -1.65&#176;.</p></li>
<li><p>Affichez le nombre total de v&#233;los disponibles dans l&#8217;ensemble des stations de la rue de Foug&#232;res.</p></li>
<li><p>Affichez la liste des stations pour lesquelles les informations ont &#233;t&#233; mises &#224; jour le 7 d&#233;cembre 2015, tri&#233;es par ordre alphab&#233;tique inverse.</p></li>
</ol>
<h1 id="la-base-ur2"><span class="header-section-number">2</span> La base <code>UR2</code></h1>
<ol start="5" style="list-style-type: decimal">
<li><p>Importez la collection <code>students</code> (contenue dans le fichier <code>students.json</code> disponible sur CURSUS) dans la base de donn&#233;es <code>UR2</code>.</p></li>
<li><p>Ajoutez 1 an &#224; l&#8217;&#226;ge de chacun des &#233;tudiants dans la collection.</p></li>
<li><p>Combien existe-t-il dans la collection d&#8217;&#233;tudiants sans note ?</p></li>
<li><p>Combien y a-t-il de notes dans la base ?</p></li>
<li><p>Affichez la moyenne des notes obtenues par des &#233;tudiants de plus de 25 ans.</p></li>
<li><p>Affichez les valeurs moyenne, minimale et maximale des notes attribu&#233;es dans le cours de &#8220;R&#8221;.</p></li>
</ol>
</body>
</html>
